app/Controllers/Lokasi.php

    public function index()
    {
        $model = new UserModel();
        $user = $model->findAll();
---
SELECT *
FROM `user`

    public function detailLokasi()
    {
        $user_token = $this->request->getPost('user_token');
        // dd($user_token);
        $model = new LokasiModel();
        $lokasi = $model->byUser($user_token);

        $model = new UserModel();
        $model->where('user_token', $user_token);
        $user = $model->first();
---
SELECT *
FROM `user`
WHERE `user_token` = 'c8_c4_k6RpagDWO6bWNuc6:APA91bFby311RsVLd3-BuvZBttJ3_PJr8f3L21jeTITBKzO0W7oS-jIQAWOMcvYp95Ir-iVQAeR6dQ6Q_7p5yNsxwGzsVtEoHAT4LNa8VHHsc_8b5Iaxt-LOrzeKDL_DsWLh5oEqw-05'
 LIMIT 1

    public function maps()
    {
        $user_token = $this->request->getPost('user_token');
        // dd($user_token);
        $model = new LokasiModel();
        $lokasi = $model->byUser($user_token);

        $model = new UserModel();
        $model->where('user_token', $user_token);
        $user = $model->first();
---
SELECT *
FROM `user`
WHERE `user_token` = 'aa4EbIOVYafrj6GbH3Ut-;?ytUU-1'
 LIMIT 1